#include "os_call.c"
#include "string.c"


#define BLACK	0
#define WHITE	1
#define GRAY	2


//	┏━━━━━━┓
//	┃・・・・・・┃
//	┃・・・・・・┃
//	┃・・・・・・
//	┃・・・・・・┃
//	┃・・・・・・┃
//	┃・・・・・・┃
//	┗━━━━━━┛

char rush_ban[8][8];	//	aaab bbbb
//	rush_ban[y][x]
//	aaa=1～4:車番号、5,6:赤い車
//	bbbbb=1からの通し番号

char rush_car_pat[7][3][3]={
	
		0,0,0,	// dummy data
		0,0,0,
		0,0,0,
	
	
		1,0,0,	// 車番号１
		1,0,0,
		0,0,0,
	
	
		1,1,0,	// 車番号２
		0,0,0,
		0,0,0,
	
	
		1,0,0,	// 車番号３
		1,0,0,
		1,0,0,
	
	
		1,1,1,	// 車番号４
		0,0,0,
		0,0,0,
	
	
		1,1,0,	// 車番号５ 赤い車
		0,0,0,
		0,0,0,
	
	
		1,1,1,	// 車番号６ 赤い車
		0,0,0,
		0,0,0
	
};

#define C // (char)
char rush_ban_test1[8][8]={	//
	20,         20,         20,         20,         20,         20,         20,      20,
	20,       32+1,          0,     32*2+7,     32*2+7,    32*1+10,          0,      20,
	20,       32+1,     32*2+4,     32*2+4,     32*3+8,    32*1+10,    32*3+12,      20,
	20,          0,  C(32*5+5),  C(32*5+5),     32*3+8,    32*1+11,    32*3+12,       0,
	20,     32*2+2,     32*2+2,     32*1+6,     32*3+8,    32*1+11,    32*3+12,      20,
	20,          0,          0,     32*1+6,  C(32*4+9),  C(32*4+9),  C(32*4+9),      20,
	20,     32*2+3,     32*2+3,          0,          0,          0,          0,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test2[8][8]={	//
	20,         20,         20,         20,         20,         20,         20,      20,
	20,          0,     32*2+1,     32*2+1,          0,     32*1+4,     32*3+5,      20,
	20,          0,     32*1+2,          0,          0,     32*1+4,     32*3+5,      20,
	20,          0,     32*1+2,  C(32*5+3),  C(32*5+3),          0,     32*3+5,       0,
	20,          0,          0,          0,     32*1+9,          0,          0,      20,
	20,     32*1+6,     32*1+7,     32*1+8,     32*1+9,    32*2+10,    32*2+10,      20,
	20,     32*1+6,     32*1+7,     32*1+8, C(32*4+11), C(32*4+11), C(32*4+11),      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test3[8][8]={	// 解いた
	20,         20,         20,         20,        20,          20,         20,      20,
	20,          0,          0,     32*3+1,         0,      32*2+2,     32*2+2,      20,
	20,          0,          0,     32*3+1,         0,           0,          0,      20,
	20,  C(32*5+3),  C(32*5+3),     32*3+1,         0,           0,          0,       0,
	20,  C(32*4+4),  C(32*4+4),  C(32*4+4),         0,           0,     32*3+5,      20,
	20,          0,          0,          0,         0,           0,     32*3+5,      20,
	20,          0,          0,          0,         0,           0,     32*3+5,      20,
	20,         20,         20,         20,        20,          20,         20,      20,
};
char rush_ban_test4[8][8]={ // 解いた
	20,         20,         20,         20,         20,         20,         20,      20,
	20,  C(32*4+1),  C(32*4+1),  C(32*4+1),     32*1+2,     32*3+3,     32*1+4,      20,
	20,          0,          0,          0,     32*1+2,     32*3+3,     32*1+4,      20,
	20,  C(32*5+7),  C(32*5+7),    32*3+10,          0,     32*3+3,     32*1+5,       0,
	20,     32*1+8,     32*1+9,    32*3+10,          0,          0,     32*1+5,      20,
	20,     32*1+8,     32*1+9,    32*3+10,          0,     32*2+6,     32*2+6,      20,
	20,          0,          0,          0,          0,          0,          0,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test5[8][8]={	// 
	20,         20,         20,         20,         20,         20,         20,      20,
	20,     32*3+1,  C(32*4+2),  C(32*4+2),  C(32*4+2),          0,     32*3+6,      20,
	20,     32*3+1,          0,          0,     32*1+4,     32*1+5,     32*3+6,      20,
	20,     32*3+1,  C(32*5+3),  C(32*5+3),     32*1+4,     32*1+5,     32*3+6,       0,
	20,          0,     32*1+7,     32*1+8,  C(32*4+9),  C(32*4+9),  C(32*4+9),      20,
	20,          0,     32*1+7,     32*1+8,    32*1+10,          0,          0,      20,
	20,          0,          0,          0,    32*1+10,          0,          0,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test6[8][8]={	// 
	20,         20,         20,         20,         20,         20,         20,      20,
	20,     32*1+1,          0,          0,     32*3+4,     32*2+5,     32*2+5,      20,
	20,     32*1+1,          0,     32*1+3,     32*3+4,          0,     32*3+7,      20,
	20,  C(32*5+2),  C(32*5+2),     32*1+3,     32*3+4,     32*1+6,     32*3+7,       0,
	20,          0,          0,          0,          0,     32*1+6,     32*3+7,      20,
	20,     32*1+8,     32*1+9,    32*2+10,    32*2+10,          0,          0,      20,
	20,     32*1+8,     32*1+9,          0, C(32*4+11), C(32*4+11), C(32*4+11),      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test7[8][8]={	// 
	20,         20,         20,         20,         20,         20,         20,      20,
	20,     32*3+1,     32*2+2,     32*2+2,          0,     32*3+5,     32*3+6,      20,
	20,     32*3+1,     32*1+3,          0,          0,     32*3+5,     32*3+6,      20,
	20,     32*3+1,     32*1+3,  C(32*5+4),  C(32*5+4),     32*3+5,     32*3+6,       0,
	20,          0,          0,          0,     32*1+9,    32*2+11,    32*2+11,      20,
	20,          0,          0,     32*1+8,     32*1+9,    32*2+12,    32*2+12,      20,
	20,     32*2+7,     32*2+7,     32*1+8,    32*2+10,    32*2+10,          0,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test8[8][8]={	// 
	20,         20,         20,         20,         20,         20,         20,      20,
	20,     32*1+1,          0,          0,     32*2+5,     32*2+5,     32*3+7,      20,
	20,     32*1+1,     32*2+2,     32*2+2,     32*1+6,          0,     32*3+7,      20,
	20,  C(32*5+3),  C(32*5+3),     32*1+4,     32*1+6,          0,     32*3+7,       0,
	20,          0,          0,     32*1+4,  C(32*4+8),  C(32*4+8),  C(32*4+8),      20,
	20,          0,          0,          0,    32*1+10,    32*2+11,    32*2+11,      20,
	20,          0,     32*2+9,     32*2+9,    32*1+10,    32*2+12,    32*2+12,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_test9[8][8]={	// 
	20,         20,         20,         20,         20,         20,         20,      20,
	20,       32+1,          0,     32*2+5,     32*2+5,    32*3+11,          0,      20,
	20,       32+1,          0,       32+6,       32+7,    32*3+11,    32*3+12,      20,
	20,  C(32*5+2),  C(32*5+2),       32+6,       32+7,    32*3+11,    32*3+12,       0,
	20,          0,       32+3,  C(32*4+8),  C(32*4+8),  C(32*4+8),    32*3+12,      20,
	20,          0,       32+3,     32*2+9,     32*2+9,    32*2+10,    32*2+10,      20,
	20,  C(32*4+4),  C(32*4+4),  C(32*4+4),          0,          0,          0,      20,
	20,         20,         20,         20,         20,         20,         20,      20,
};
char rush_ban_init_data[8][8]={
	20,20,20,20,20,20,20,20,
	20, 0, 0, 0, 0, 0, 0,20,
	20, 0, 0, 0, 0, 0, 0,20,
	20, 0, 0, 0, 0, 0, 0, 0,
	20, 0, 0, 0, 0, 0, 0,20,
	20, 0, 0, 0, 0, 0, 0,20,
	20, 0, 0, 0, 0, 0, 0,20,
	20,20,20,20,20,20,20,20,
};

char *rush_msg1;
char *rush_msg2;
char *rush_msg3;
char *rush_msg4;
/********************************************************************************/
/*		lcd_clearA																*/
/********************************************************************************/
void lcd_clearA(int x1, int y1, int x2, int y2, int color)
{
	int x, y;
	
	for(x=x1; x<=x2; x++){
		for(y=y1; y<=y2; y++){
			if(color==GRAY)
				Pset(x, y, (x^y)&1);
			else
				Pset(x, y, color);
		}
	}
}
/********************************************************************************/
/*		rush_ban_init															*/
/********************************************************************************/
void rush_ban_init()
{
	memcpy(rush_ban, rush_ban_init_data, sizeof(rush_ban));
}
/********************************************************************************/
/*		rush_koma_disp															*/
/*		x,y で指定した位置に正方形を１個表示する、色指定もできる				*/
/********************************************************************************/
void rush_koma_disp(int x, int y, int color)
{
	lcd_clearA(80+20*x, 20*y+60, 80+19+20*x, 19+20*y+60, color);
}
/********************************************************************************/
/*		rush_disp_ban															*/
/*		盤を表示する															*/
/********************************************************************************/
void rush_disp_ban()
{
	int x, y, num, car;
	
	for(y=0; y<8; y++){
		for(x=0; x<8; x++){
			car = (rush_ban[y][x] >> 5) & 7;
			num = rush_ban[y][x] & 0x1f;
			if(rush_ban[y][x]){
				if(car <= 4){
					rush_koma_disp(x, y, WHITE);
				}
				else{					// 赤い車
					rush_koma_disp(x, y, GRAY);	// 赤
				}
			}
		}
	}
	for(y=1; y<7; y++){
		for(x=0; x<7; x++){
			if(rush_ban[y][x] != rush_ban[y][x+1])
				lcd_clearA(80+19+20*x, 20*y+60, 80+21+20*x, 19+20*y+60, BLACK);
		}
	}
	for(x=1; x<7; x++){
		for(y=0; y<7; y++){
			if(rush_ban[y][x] != rush_ban[y+1][x])
				lcd_clearA(80+20*x, 19+20*y+60, 80+19+20*x, 21+20*y+60, BLACK);
		}
	}
}
/********************************************************************************/
/*		rush_disp_car															*/
/*		車を１台表示する														*/
/*		car: 1～6 の車番号														*/
/*		str: 全角１文字															*/
/********************************************************************************/
void rush_disp_car(int x, int y, int car, int tooshi)
{
	int x1, y1, car1;
	
	for(y1=0; y1<3; y1++){
		for(x1=0; x1<3; x1++){
			if(car <= 4){
				if(rush_car_pat[car][y1][x1]){
					rush_koma_disp(x+x1, y+y1, WHITE);
				}
			}
			else{					// 赤い車
				car1 = car==5 ? 2 : 4;
				if(rush_car_pat[car1][y1][x1]){
					rush_koma_disp(x+x1, y+y1, GRAY);	// 背景色　赤
				}
			}
		}
	}
}
/********************************************************************************/
/*		rush_make_param															*/
/*		x,y 位置の駒から car_numb と tooshi_bango を作る						*/
/********************************************************************************/
void rush_make_param(int x, int y, int *p_car_numb, int *p_tooshi_bango)
{
	*p_car_numb = (rush_ban[y][x] >> 5) & 7;
	*p_tooshi_bango = rush_ban[y][x] & 0x1f;
}
/********************************************************************************/
/*		rush_put_car_test														*/
/*		return 1: 置ける、0:置けない											*/
/********************************************************************************/
int rush_put_car_test(char ban[8][8], int x, int y, int car_numb)
{
	int x1, y1;
	
	for(y1=0; y1<3; y1++){
		for(x1=0; x1<3; x1++){
			if(ban[y+y1][x+x1] && rush_car_pat[car_numb][y1][x1])
				return 0;				// 置けない
		}
	}
	return 1;							// 置ける
}
/********************************************************************************/
/*		rush_move_car															*/
/*		車を移動して遊ぶ														*/
/********************************************************************************/
void rush_move_car()
{
	int cursor, key, tmp, i, koma, savex, savey, x, y, x1, y1, nextx, nexty, car_numb, tooshibango;
	
	cursor = 1;								// 動かす駒の通し番号
	x = y = x1 = y1 = 0;
	for(;;){
		scrn_clear();
		printf("F9/F10: select, ﾔｼﾞﾙｼ key: move\n");
		rush_disp_ban();
//		/***	車を選択する	***/
//		for(;;){
//			sw = sw_updown();
//			if(sw & 2){				// sw2: exit
//				longjmp(main_env, 1);
//			}
//			if(sw & 4){			// touch
//				savex = tch_x;
//				savey = tch_y;
//				x = ((savex)-80)/20;			// 配列添え字にする
//				y = (savey)/20;				// 配列添え字にする
//				if(x<1 || x>6 || y<1 || y>6 || rush_ban[y][x]==0)
//					continue;		// 車でない
//				break;
//			}
//		}

		for(x=1; x<=6; x++){
			for(y=1; y<=6; y++){
				if(cursor==(rush_ban[y][x] & 0x1f))
					goto next1;
			}
		}
next1:;
		lcd_clearA(80+20*x+7, 20*y+7+60, 80+19+20*x-7, 19+20*y-7+60, BLACK);	// cursor disp
		key = ut_getc();
		/***	次の車に移動する	***/
		if(key==F9 || key==F10){
			if(key==F10){
				tmp = cursor+1;
			}
			else{
				tmp = cursor-1;
				if(tmp<=0)
					tmp = 1;
			}
			for(x=1; x<=6; x++){
				for(y=1; y<=6; y++){
					if(tmp==(rush_ban[y][x] & 0x1f)){
//cursor_set(0,0);printf("tmp=%d x=%d y=%d    \n", tmp, x, y);ut_getc();
						cursor = tmp;
					}
				}
			}
			continue;
		}
		
		/***	車を移動する	***/
		rush_make_param(x, y, &car_numb, &tooshibango);	// パラメータ作成
		
		koma = (unsigned char)rush_ban[y][x];	// x,y を左上にする
		while(koma==(unsigned char)rush_ban[y][x-1]){
			x--;
		}
		while(koma==(unsigned char)rush_ban[y-1][x]){
			y--;
		}
//		for(;;){
//			if(tch_read(&x1, &y1)==0){		// no touch
//				wait_1ms();
//				if(--cnt < -200){
//					break;					// 再度　車の選択に戻る
//				}
//			}
//			else{							// touch
				/* 移動したかテストする	*/
				if(car_numb==1 || car_numb==3){	// 上下移動
					nextx = x;
					if(key==DOWN)
						nexty = y+1;
					else if(key==UP)
						nexty = y-1;
					else
						continue;
				}
				else{							// 左右移動
					nexty = y;
					if(key==RIGHT)
						nextx = x+1;
					else if(key==LEFT)
						nextx = x-1;
					else
						continue;
				}
				/***	移動できるかテストする	***/
				for(i=0; i<sizeof(rush_ban); i++){		// rush_ban から koma 削除
					if((koma & 0xff)==((unsigned char*)rush_ban)[i])
						((unsigned char*)rush_ban)[i] = 0;
				}
				if(rush_put_car_test(rush_ban, nextx, nexty, car_numb)){	// 移動できる
					x = nextx;								// 現在位置更新
					y = nexty;
                    savex = x1;
                    savey = y1;
				}
				for(y1=0; y1<3; y1++){				// 現在位置に駐車する
					for(x1=0; x1<3; x1++){
						if(rush_car_pat[car_numb][y1][x1]){
							rush_ban[y+y1][x+x1] = (car_numb<<5) + tooshibango;
						}
					}
				}
				rush_disp_ban();
				if(((rush_ban[3][7] >> 5) & 0x7)==5){	// パズル完成
//					lcd_clearA(0, 20*8, 319, 239, WHITE);
					printf("ｵﾒﾃﾞﾄｳｺﾞｻﾞｲﾏｽ\n");
//					ut_getc();
					return;
				}
//			}
//		}
	}
}
/********************************************************************************/
/*		main																	*/
/********************************************************************************/
int main()
{
	int cmd;
	
	rush_ban_init();						// 盤初期化
	scrn_clear();
	for(;;){
		printf("\nﾚｲﾀﾞｲ 1 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test1, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 2 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test2, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 3 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test3, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 4 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test4, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 5 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test5, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 6 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test6, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 7 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test7, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 8 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test8, sizeof(rush_ban));
			break;
		}
		printf("\nﾚｲﾀﾞｲ 9 (y/n) ? ");
		if(ut_getc()=='y'){
			memcpy(rush_ban, rush_ban_test9, sizeof(rush_ban));
			break;
		}
	}
	rush_move_car();					// 車を移動して遊ぶ
	return 0;
}
